def greetings():
    print("\nВас приветствует программа: 'Одиночка...' в ней собрана небольшая реализация телефонного справочника.")
    
def menu():
    print('''          
          Menu:
          -----
          Выберети нужный пункт меню:
          --------------------------- 
          1 - Смотреть телефонный справочник
          2 - Добавить новый контакт в телефонный справочник
          3 - Поиск в телефонном справочнике
          4 - Редактирование данных
          5 - Удаление данных
          6 - Завершить работу
          ''')
       
def show_phonebook(data):
    print(*data)    

def show_add_contact(data2):
    print(f'Добавлен новый контакта: {data2}')

def print_find(data3):
    print(f'Найденные данные: {data3}')
    
def print_editing(data4):
    print(f'Изменённая запись: {data4}')
    
def string_delete(data5):
    print(f'Запись {data5} удалена')
    
def show_break():
    print('Завершение работы, всего доброго!!!')
    
def incorrect_answer():
    print('Ввели число не находящиеся в списке. Ввели не число!')